#include<iostream>
using namespace std;
int main(){
	int n,m,x,y;//输入B点(n,m)和C点(x,y)的坐标 
    cin>>n>>m>>x>>y;
    n+=2; m+=2; x+=2; y+=2; //平移全部坐标，防止二维数组越界 
	bool s[40][40]={0};//判断这个点是不是马的控制点，是就标记为1 
    s[x][y]=1;//标记马的控制点 C 
	//马的控制点    C P1 P2 P3 P4 P5 P6 P7 P8 (相对位置) 
	const int fx[]={0, 2, 1,-1,-2,-2,-1, 1, 2};
	const int fy[]={0, 1, 2, 2, 1,-1,-2,-2,-1};
    //标记马的控制点 P1 P2 P3 P4 P5 P6 P7 P8 
    for(int i=1;i<=8;i++){
    	s[x+fx[i]][y+fy[i]]=1;
	}
	//知识点：动态规划 
	long long f[40][40]={0};//动态规划的状态定义，f[x][y]代表卒从(0,0)走到(x,y)的路径数，在进行计算前先设置默认值为0。 
	f[2][1]=1;//动态规划的边界条件。（该点无实际意义，仅方便计算） 
    for(int i=2;i<=n;i++){
        for(int j=2;j<=m;j++){
        	//如果被马拦住就直接跳过。此时f[i][j]==0，不计入路径数。 
            if(s[i][j]==1){
				continue;
			}
			//动态规划的转移方程，到达(i,j)的路径数等于从上方(i-1,j)和左方(i,j-1)到达的路径数之和。
            f[i][j]=f[i-1][j]+f[i][j-1];
        }
    }
    cout<<f[n][m];//输出卒走到B点的路径总数。
    return 0;
} 
